const String ksHomePage = "الصفحة الرئيسة";
const String ksAboutApp = "حول التطبيق";
const String ksShareApp = "مشاركة التطبيق";
const String ksMaps = "الخرائط";
const String ksManasicAlhajj = "مناسك الحَج";
const String ksExit = "خروج";
const String ksHajjTypes = "أنواع الحَجْ";

const String ksHajjEfrad = "حَجُ الإِفراد";
const String ksBeforOf8 = "أعمال ما قبل اليوم الثامن من ذو الحجة";

const String ksMagamIbrahim = "مقام إبراهيم";
const String ksZmzm = "زمزم";


const String ksAtDay8 = "أعمال يوم الثامن من ذو الحجة";

const String ksMSleepInMena = "المبيت بمنى";

const String ksAtDay9 = "أعمال يوم عرفة";

const String ksAtDay10 = "أعمال يوم العاشر من ذو الحجة";

const String ksMGamratAlagaba = "جمرة العقبة";
const String ksMRansom = "ذبح الهدي";
const String ksMCutAndShaving = "الحلق والتقصير";
const String ksMTawafAlefada = "طواف الإفاضة";

const String ksMIfadaToMozdalifa = "مزدلفة";

const String ksHajjAlQiran = "حَجُ القِران";
const String ksHajjAltamattu = "جَحُ التمتُّع";
const String ksManasicAlOmrah = "مَناسك العُمرة";
const String ksAdabAlZiarah = "آداب الزيارة";
const String ksAzkarMostahaba = "أذكَار مستحبة";
const String ksAzkarAlSabah = "أذكَار الصباح";
const String ksAzkarAlMasa = "أذكَار المساء";
const String ksAzkarBaadAlSalah = "أذكَار بعد الصلاة";
const String ksAzkar = "أذكَار";
const String ksQuran = "القُرآن الكَريم";
const String ksSebha = "سِبحة";
const String ksHajjHelp = "دليل الحاج";
const String ksPrayTime = "أوقات الصلاة";
const String ksSetting = "الضبط";
const String ksNeiaa = "النية";
const String ksMIhram = "الإِحْرام";
const String ksMTawaf = "الطواف";
const String ksMSaee = "السعي";
const String ksMArafa = "الوقوف بعرفة";
const String ksRamiAlgamarat = "رمي الجمرات";
const String ksBefore = "ما قبل النسك";
const String ksWagibatAlIhram = "الواجِبَات";
const String ksSunnAlIhram = "السُنَنْ";
const String ksMndobatAlIhram = "المَندُوبات";
const String ksMahzoratAlIhram = "المحْظُورات";
const String ksVedios = "فيديوهات تعليمية";


const String ksAboutHajj = "عن الحاج";
const String ksGender = "جنس الحاج";
const String ksMale = "ذكر";
const String ksFemale = "أنثى";

const String ksBefore8ZoElhejja = "قبل يوم عرفة";
const String ksAfter8ZoElhejja = "يوم عرفة";

const String ksTimeToArriveMaka = "زمن الوصول الى مكة";

const String ksSave = "حفظ";



const String ast1 = "آية الكرسي";
const String asc1 =
    "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\nاللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ\n [آية الكرسي - البقرة 255]";
const String asf1 =
    "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح";

const String ast2 = "سورة الإخلاص";
const String asc2 =
    "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ";
const String asf2 =
    "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)";

const String ast3 = "سورة الفلق";
const String asc3 =
    "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ";
const String asf3 =
    "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح";

const String ast4 = "سورة الناس";
const String asc4 =
    "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \nقُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ";
const String asf4 =
    "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح";

const String ast5 = "أَصْـبَحْنا وَأَصْـبَحَ";
const String asc5 =
    "المُـلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير\nرَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه\n رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر\nرَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر";
const String asf5 = "";

const String ast6 = "دعاء";
const String asc6 =
    "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ";
const String asf6 =
    "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح";

const String ast7 = "رَضيـتُ بِاللهِ رَبَّاً";
const String asc7 =
    "وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً";
const String asf7 =
    "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة";

const String ast8 = "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ";
const String asc8 =
    "أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك";
const String asf8 = "من قالها أعتقه الله من النار";

const String ast9 = "اللّهُـمَّ ما أَصْبَـَحَ";
const String asc9 =
    "بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.";
const String asf9 = "من قالها حين يصبح أدى شكر يومه";

const String ast10 = "حَسْبِـيَ اللّهُ";
const String asc10 =
    "لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم";
const String asf10 = "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة";

const String ast11 = "بِسـمِ اللهِ";
const String asc11 =
    "الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم";
const String asf11 = "لم يضره من الله شيء";

const String ast12 = "اللّهُـمَّ بِكَ أَصْـبَحْنا";
const String asc12 =
    "وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور";
const String asf12 = "";

const String ast13 = "أَصْبَـحْـنا";
const String asc13 =
    "عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ";
const String asf13 = "";

const String ast14 = "سُبْحـانَ اللهِ";
const String asc14 =
    "وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه";
const String asf14 = "";

const String ast15 = "دعاء";
const String asc15 =
    "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ";
const String asf15 = "";

const String ast16 = "دعاء";
const String asc16 =
    "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ";
const String asf16 = "";

const String ast17 = "اللّهُـمَّ إِنِّـي";
const String asc17 =
    "أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي";
const String asf17 = "";

const String ast18 = "يَا حَيُّ يَا قيُّومُ";
const String asc18 =
    "بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ";
const String asf18 = "";

const String ast19 = "أَصْبَـحْـنا وَأَصْبَـحْ";
const String asc19 =
    "المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَ";
const String asf19 = "";

const String ast20 = "اللّهُـمَّ عالِـمَ";
const String asc20 =
    "الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم";
const String asf20 = "";

const String ast21 = "أَعـوذُ بِكَلِمـات";
const String asc21 = "ِاللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق";
const String asf21 = "";

const String ast22 = "اللَّهُمَّ صَلِّ";
const String asc22 = "وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد";
const String asf22 = "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة";

const String ast23 = "اللَّهُمَّ إِنَّا";
const String asc23 =
    "نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ";
const String asf23 = "";

const String ast24 = "اللَّهُمَّ إِنِّي";
const String asc24 =
    "أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ";
const String asf24 = "";

const String ast25 = "أسْتَغْفِرُ اللهَ";
const String asc25 =
    "العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ";
const String asf25 = "";

const String ast26 = "يَا رَبِّ";
const String asc26 =
    "لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ";
const String asf26 = "";

const String ast27 = "اللَّهُمَّ";
const String asc27 =
    "إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا";
const String asf27 = "";

const String ast28 = "اللَّهُمَّ أَنْتَ رَبِّي";
const String asc28 =
    "لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ";
const String asf28 = "";

const String ast29 = "لَا إلَه إلّا الله";
const String asc29 =
    "وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ";
const String asf29 =
    "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان";

const String ast30 = "تسبيح";
const String asc30 = "سُبْحـانَ اللهِ وَبِحَمْـدِهِ";
const String asf30 =
    "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ";

const String ast31 = "إستغفار";
const String asc31 = "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ";
const String asf31 =
    "مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى";

const String amt1 = "آية الكرسي";
const String amc1 =
    "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\nاللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ\n [آية الكرسي - البقرة 255]";
const String amf1 =
    "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح";

const String amt2 = "آيتي البقرة";
const String amc2 =
    "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\nآمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ\n[البقرة 285 - 286]";
const String amf2 = "من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه";

const String amt3 = "سورة الإخلاص";
const String amc3 =
    "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ";
const String amf3 =
    "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)";

const String amt4 = "سورة الفلق";
const String amc4 =
    "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ";
const String amf4 =
    "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح";

const String amt5 = "سورة الناس";
const String amc5 =
    "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \nقُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ";
const String amf5 =
    "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح";

const String amt6 = "أَمْسَيْـنا وَأَمْسـىَ";
const String amc6 =
    "المُـلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير\nرَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه\n رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر\nرَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر";
const String amf6 = "";

const String amt7 = "اللّهـمَّ أَنْتَ رَبِّـي";
const String amc7 =
    "لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ";
const String amf7 =
    "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح";

const String amt8 = "رَضيـتُ بِاللهِ رَبَّاً";
const String amc8 =
    "وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً";
const String amf8 =
    "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة";

const String amt9 = "اللّهُـمَّ إِنِّـي أَمسيتُ";
const String amc9 =
    "أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك";
const String amf9 = "من قالها أعتقه الله من النار";

const String amt10 = "اللّهُـمَّ ما أَمسى";
const String amc10 =
    "بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.";
const String amf10 = "من قالها حين يصبح أدى شكر يومه";

const String amt11 = "حَسْبِـيَ اللّهُ";
const String amc11 =
    "لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم";
const String amf11 = "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة";

const String amt12 = "بِسـمِ اللهِ";
const String amc12 =
    "الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم";
const String amf12 = "لم يضره من الله شيء";

const String amt13 = "اللّهُـمَّ بِكَ أَمْسَيْنَا";
const String amc13 =
    "وَبِكَ أَصْبَـحْـنا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور";
const String amf13 = "";

const String amt14 = "أَمْسَيْنَا";
const String amc14 =
    "عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ";
const String amf14 = "";

const String amt15 = "سُبْحـانَ اللهِ";
const String amc15 =
    "وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه";
const String amf15 = "";

const String amt16 = "اللّهُـمَّ عافِـني";
const String amc16 =
    "في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ";
const String amf16 = "";

const String amt17 = "اللّهُـمَّ إِنّـي";
const String amc17 =
    "أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ";
const String amf17 = "";

const String amt18 = "اللّهُـمَّ إِنِّـي";
const String amc18 =
    "أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي";
const String amf18 = "";

const String amt19 = "يَا حَيُّ يَا قيُّومُ";
const String amc19 =
    "بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ";
const String amf19 = "";

const String amt20 = "أَمْسَيْنا وَأَمْسَى";
const String amc20 =
    "المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَ";
const String amf20 = "";

const String amt21 = "اللّهُـمَّ عالِـمَ";
const String amc21 =
    "الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم";
const String amf21 = "";

const String amt22 = "أَعـوذُ بِكَلِمـات";
const String amc22 = "ِاللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق";
const String amf22 = "";

const String amt23 = "اللَّهُمَّ صَلِّ";
const String amc23 = "وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد";
const String amf23 = "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة";

const String amt24 = "اللَّهُمَّ إِنَّا";
const String amc24 =
    "نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ";
const String amf24 = "";

const String amt25 = "اللَّهُمَّ إِنِّي";
const String amc25 =
    "أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ";
const String amf25 = "";

const String amt26 = "أسْتَغْفِرُ اللهَ";
const String amc26 =
    "العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ";
const String amf26 = "";

const String amt27 = "يَا رَبِّ";
const String amc27 =
    "لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ";
const String amf27 = "";

const String amt28 = "اللَّهُمَّ أَنْتَ رَبِّي";
const String amc28 =
    "لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ";
const String amf28 = "";

const String amt29 = "لَا إلَه إلّا الله";
const String amc29 =
    "وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ";
const String amf29 =
    "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان";

const String amt30 = "اللَّهُمَّ";
const String amc30 =
    "إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا";
const String amf30 = "";

const String amt31 = "تسبيح";
const String amc31 = "سُبْحـانَ اللهِ وَبِحَمْـدِهِ";
const String amf31 =
    "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ";

const String amt32 = "إستغفار";
const String amc32 = "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ";
const String amf32 =
    "مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى";
